SOAP Requests/Sample Request1.xml

<?xml version="1.0" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetConversionRate>
         <!--Optional:-->
         <tem:CurrencyFrom>USD</tem:CurrencyFrom>
         <!--Optional:-->
         <tem:CurrencyTo>INR</tem:CurrencyTo>
         <tem:RateDate>2020-03-20T00:00:00</tem:RateDate>
      </tem:GetConversionRate>
   </soapenv:Body>
</soapenv:Envelope>